tap "homebrew/bundle"
brew "coreutils"
brew "asdf"
brew "chezmoi"
brew "curl"
brew "git"
brew "lazygit"
brew "mas"
brew "neovim"
brew "rustup"
brew "sheldon"
brew "starship"
brew "zellij"
cask "alacritty"
cask "appcleaner"
cask "cursor"
cask "discord"
cask "docker"
cask "figma"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "obsidian"
cask "parsec"
cask "protokol"
cask "protonvpn"
cask "raycast"
cask "responsively"
cask "slack"
cask "tailscale"
cask "touchdesigner"
cask "visual-studio-code"
mas "LINE", id: 539883307
mas "Parallels Client", id: 600925318
mas "The Unarchiver", id: 425424353
vscode "anysphere.pyright"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "jchannon.csharpextensions"
vscode "k--kato.docomment"
vscode "kevinrose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "peakchen90.open-html-in-browser"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "slevesque.shader"
vscode "tauri-apps.tauri-vscode"
vscode "toba.vsfire"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmsynkov.colonize"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
